# Завдання 3: Координатні чверті
# Зчитування координат як цілих чисел (int)
x = int(input("Введіть координату x: "))
y = int(input("Введіть координату y: "))

if x > 0 and y > 0:
    print(f"Точка з координатами ({x}, {y}) знаходиться в I чверті.")
elif x < 0 and y > 0:
    print(f"Точка з координатами ({x}, {y}) знаходиться в II чверті.")
elif x < 0 and y < 0:
    print(f"Точка з координатами ({x}, {y}) знаходиться в III чверті.")
elif x > 0 and y < 0:
    print(f"Точка з координатами ({x}, {y}) знаходиться в IV чверті.")
else:
    print(f"Точка з координатами ({x}, {y}) лежить на осі координат.")