# Завдання 4: Математичний калькулятор
# Завдання 4: Математичний калькулятор

a = float(input("Введіть перше число: "))
b = float(input("Введіть друге число: "))
operator = input("Введіть оператор (+, -, *, /): ")

match operator:
    case "+":
        print(f"Результат: {a + b}")
    case "-":
        print(f"Результат: {a - b}")
    case "*":
        print(f"Результат: {a * b}")
    case "/":
        if b != 0:
            print(f"Результат: {a / b}")
        else:
            print("Помилка: ділення на нуль неможливе!")
    case _:
        print("Помилка: введено невідомий оператор!")